'use client'

import Link from "next/link";
import Image from "next/image";
import {motion} from "framer-motion";
import {usePathname} from "next/navigation";
import { CommentModalProvider } from "@/components/modalcontextcomment";
import {countries} from "@/data/countries";
import Contacts from "@/components/contacts";
import Breadcrumbs from "@/components/Breadcrumbs";
import Faqs, {faqData} from "@/components/faqpage/faqpage";
import NextArticleLink from "@/components/nextArtLink";
import dynamic from 'next/dynamic';
import { useCommentModal } from "../modalcontextcomment";

const year = new Date().getFullYear();

const RippleButton = ({ onClick, children }) => (
    <button
        onClick={onClick}
        className="w-full lg:!w-[255px] mx-[auto] bbbt relative overflow-hidden w-full bg-customBlue hover:bg-blue-600 text-white py-3 rounded-full shadow-[0_2px_4px_-2px_rgba(0,122,255,0.8)] active:scale-95 transition-transform duration-150 ease-in-out"
    >
        {[0, 1, 2].map((i) => (
            <motion.span
                key={i}
                className="absolute inset-0 flex items-center justify-center"
                initial={{ scale: 0, opacity: 1.5 }}
                animate={{ scale: 4, opacity: 0 }}
                transition={{
                    duration: 2,
                    repeat: Infinity,
                    ease: "easeOut",
                    repeatDelay: 0.5,
                    delay: i * 0.4,
                }}
            >
                <span className="absolute w-4 h-4 bg-gray-300 bg-opacity-40 rounded-full"/>
            </motion.span>
        ))}
        {children}
    </button>
);

const BreadcrumbNav = ({pathname}) => (
    <nav className="mb-4 mdd:text-xs flex items-baseline sm:space-x-2 mdd:space-x-0 text-gray-600 gap-2">
        <Link href="/"
              className="text-orange-500 hover:underline active:scale-95 transition-transform duration-150 ease-in-out">
            Главная
        </Link>
        <Image src="/nav-icon.png" alt=">" width={8} height={8} className="w-2"/>
        <Link
            href="/poleznaya-informasia"
            className={`text-orange-500 hover:underline ${pathname === "/poleznaya-informasia" ? "font-semibold text-gray-900 pointer-events-none w-full active:scale-95 transition-transform duration-150 ease-in-out" : ""}`}
        >
            Полезная информация
        </Link>
        <Image src="/nav-icon.png" alt="" width={8} height={8} className="w-2"/>
        <span className="font-semibold text-gray-900 cursor-default">Ответы на частые вопросы</span>
    </nav>
);

export default function FaqPage({breadcrumbs}) {
    const pathname = usePathname();
    const {openCommentModal} = useCommentModal();

    // FAQ Schema
    const faqSchema = {
        "@context": "https://schema.org",
        "@type": "FAQPage",
        "mainEntity": faqData.map((faq) => ({
            "@type": "Question",
            "name": `ВОПРОС: ${faq.question}`,
            "acceptedAnswer": {
                "@type": "Answer",
                "text": faq.answer
            }
        }))
    };

    // Article Schema
    const articleSchema = {
        "@context": "https://schema.org",
        "@type": "NewsArticle",
        "author": [{
          "@type": "Person",
          "name": "Елизавета Бокая",
          "jobTitle": "руководитель отдела продаж"
        }],
        "headline": "Как получить рабочую визу: документы, этапы и советы для белорусов | VISA VAM",
        "alternativeHeadline": "Узнайте, как получить рабочую визу в Европу: какие документы нужны, как подать заявление и избежать отказа. Пошаговая инструкция от VISA VAM - помощь в оформлении визы по всей Беларуси, 10 лет опыта, страховка от отказа.",
        "datePublished": "2025-11-01T08:00:00+05:00",
        "dateModified": "2025-11-01T21:33:00+05:00",
        "articleBody": `
Как получить рабочую визу: полное руководство для белорусов в 2025 году
Хотите работать в другой стране? Это отличный шанс хорошо заработать, набраться опыта и посмотреть мир. Многие едут за хорошей зарплатой, новыми возможностями и стабильностью.
Чтобы всё было легально, нужна рабочая виза. С ней в другой стране вы сможете устроиться на работу официально, а значит, ваши права будут защищены. Вы будете чувствовать себя спокойно и уверенно. Работать нелегально - плохая идея. Давайте лучше разберёмся, как правильно получить рабочую визу.
(H2) Что такое рабочая виза и почему без нее не обойтись?
Многие ошибочно полагают, что для работы за рубежом достаточно любой визы. Это не так. Туристическая, гостевая или деловая виза не дают права на трудоустройство. Попытка работать по ним может привести к депортации и запрету на въезд в страны ЕС.
💡 Важно: нельзя приехать по туристической визе и “переоформить” её на рабочую уже за границей. Процесс получения нужно начинать заранее - ещё находясь в Беларуси.
(H3) Ключевые отличия рабочей визы:
Для работы выдается национальная долгосрочная виза типа D, а не краткосрочная шенгенская виза типа C.
Она четко подтверждает, что вы едете в страну именно для трудовой деятельности.
Процесс нужно начинать заблаговременно, находясь в Беларуси.
Понимание этих нюансов - первый шаг к успешному результату.
(H2) Популярные направления для трудоустройства
Белорусы чаще всего выбирают для работы страны Европейского союза. Требования в каждой стране могут незначительно отличаться, но общий принцип остается схожим, поэтому важно заранее уточнить все нюансы.
Наиболее востребованные направления среди белорусов:
Польша
Германия
Литва
Чехия
Италия
Испания
Латвия.

Особенно часто наших клиентов интересует, как получить рабочую визу в Польшу или Германию. Эти страны предлагают множество вакансий, достойные условия труда и упрощённые требования для граждан Беларуси. Польша привлекает возможностью быстрого трудоустройства, а Германия - отсутствием верификации, высокими зарплатами и стабильностью. Наши специалисты знают все актуальные требования для каждого направления и помогут оформить визу без лишних хлопот.
### Какие документы нужны для рабочей визы?
Это самый ответственный этап, где любая ошибка может привести к отказу. Точный список зависит от страны, но базовый пакет бумаг практически всегда одинаков.
Вот что требуется:
Действующий паспорт (не менее 6 месяцев до окончания, 2 свободные страницы);
Фотографии установленного образца;
Заполненная анкета на рабочую визу;
Приглашение от работодателя или подписанный трудовой договор;
Медицинская страховка на срок действия визы;
Подтверждение финансовой состоятельности или гарантия от работодателя;
Документы об образовании и квалификации (дипломы, сертификаты);
Медицинская справка об отсутствии противопоказаний для работы.
В некоторых случаях могут потребоваться и другие документы для трудовой визы: справка о несудимости, подтверждение финансовой состоятельности или языковые сертификаты.
(H2) Как оформить рабочую визу: пошаговый процесс
Процедура получения визы может показаться сложной, но если разбить ее на этапы, все становится понятнее.
(H3) Этапы оформления:
Консультация и подготовка со специалистом. Первый и самый важный шаг, который дает понять, что нужно для оформления рабочей визы в вашем конкретном случае. На этом этапе мы анализируем вашу ситуацию и составляем точный список документов.
Сбор и проверка документов - мы помогаем корректно заполнить анкету и проверяем каждый документ на соответствие требованиям консульства. Профессиональная подготовка сводит риск ошибок к нулю.
Запись на подачу. Самостоятельно "поймать" свободное место в визовом центре бывает очень сложно. Мы берем эту задачу на себя и записываем вас на удобную дату.
Подача собранного пакета документов в визовый центр или консульство.
Ожидание решения - варьируется от 7 до 45 рабочих дней в зависимости от страны и загруженности консульства.
Получение паспорта. Вы забираете паспорт с готовой визой и можете готовиться к поездке.
### Совет:  Если вы не знаете, как подать документы на рабочую визу или опасаетесь ошибок - лучше доверить процесс специалистам.
###  Почему могут отказать в визе?
Отказ в рабочей визе - это неприятно, но не приговор. Важно понимать причины, чтобы избежать их в будущем.
Ошибки в анкете или неполный пакет документов.
Сомнения в подлинности приглашения от работодателя.
Несоответствие вашей квалификации заявленной должности.
Предоставление ложной информации.
Хорошая новость: в отличие от туристических виз, прошлая визовая история почти не влияет на решение. Важнее правильно подготовленный пакет документов.
###  VISA VAM - ваш надежный партнер в Минске
Если не знаете, как оформить рабочую визу и какие документы подготовить, специалисты VISA VAM помогут на каждом этапе. Мы уже более 10 лет помогаем белорусам получать визы для работы, учебы и путешествий. Мы знаем, как важен результат, и делаем все, чтобы процесс прошел для вас без стресса.
### Почему нам доверяют:
Полное сопровождение. Мы ведем вас за руку: от первой консультации и помощи в заполнении анкеты до успешной подачи документов.
Индивидуальный подход. Мы не работаем по шаблону. Для каждого клиента мы находим персональное решение, учитывая его ситуацию и цели.
Экономия вашего времени. Мы знаем все актуальные требования консульств и берем на себя самые сложные этапы, включая запись на подачу.
Страховка от отказа. Мы уверены в качестве своей работы, поэтому предлагаем уникальный оффер - страховку на возврат средств за услуги, которая защитит ваши интересы.
Мы поможем не только с проверкой, но и с подготовкой полного пакета документов, чтобы ваш путь к работе мечты был максимально простым и быстрым.

`,
        "about": [
            { "@type": "Thing", "name": "рабочая виза" },
            { "@type": "Thing", "name": "виза для белорусов" },
            { "@type": "Thing", "name": "2025 год" },
            { "@type": "Thing", "name": "путешествия в Европу" },
            { "@type": "Thing", "name": "работа в Европе" }
        ],
        "url": "https://visavampro.by/poleznaya-informasia/kak-poluchit-rabochyu-vizy",
        "publisher": {
            "@type": "Organization",
            "name": "VISA VAM",
            "url": "https://visavampro.by/",
            "logo": {
                "@type": "ImageObject",
                "url": "/logo.png",
                "width": 600,
                "height": 60
            }
        },
        "mainEntityOfPage": {
            "@type": "WebPage",
            "@id": "https://visavampro.by/poleznaya-informasia/kak-poluchit-rabochyu-vizy"
        }
    };

    return (
        <div>
            {breadcrumbs && <Breadcrumbs breadcrumbs={breadcrumbs}/>}

            <div
                className="w-full relative left-0 top-[200px] lg:top-[250px] mdd:top-[135px] flex flex-col sm:flex-col justify-between">
                <div
                    className="w-full text-left lg:text-left z-10 px-[7%] flex flex-col lg:gap-24 sm:gap-12 mdd:gap-12">
                    <BreadcrumbNav pathname={pathname}/>
                    <h1 className="ht:text-[40px] lg:text-[40px] md:text-[40px] sm:text-[34px] mdd:text-[28px] font-semibold text-black">
                        ОТВЕТЫ НА ЧАСТЫЕ ВОПРОСЫ 
                    </h1>
                </div>
            </div>

            <div className="relative mt-[200px] md:mt-[320px]">
                {/* Banner Section */}
                {/* <div className="w-full relative">
                    <Image
                        src="/topic10.webp"
                        alt="О компании VisaVam"
                        width={1600}
                        height={1000}
                        priority={true}
                        className="w-full h-96 object-cover object-[50%_20%] px-0 lg:px-[7%] md:px-[7%] mdd:hidden"
                    />
                    <Image
                        src="/topic10.webp"
                        alt="О компании VisaVam"
                        width={600}
                        height={400}
                        quality={80}
                        priority={true}
                        loading="eager"
                        className="w-full object-cover px-0 lg:px-[7%] md:px-[7%] sm:hidden"
                    />
                </div> */}

                {/* About Text Section */}
                <div
                    className="w-full relative flex flex-col gap-24 mdd:gap-12 px-[7%] pt-32 mdd:pt-20 text-[16px] mdd:text-[14px]">
                    <div className="w-[80%] mdd:w-full flex flex-col gap-4">
                        <p>
                            Планируете поездку за границу, но процесс получения визы кажется сложным и запутанным? Вы не одиноки. 
                        </p>
                        <p>
                            Мы собрали на этой странице ответы на самые распространенные вопросы, 
                            с которыми сталкиваются наши клиенты. Здесь вы найдете <u>ключевую информацию о сроках, 
                            требованиях, типах виз и правилах въезда</u>.
                        </p>
                        <p>
                            Наша цель — сделать для вас процесс подготовки документов максимально прозрачным и предсказуемым. 
                        </p>
                        <p>
                            Если Вы не нашли ответ на свой вопрос, <u>свяжитесь с нами для получения индивидуальной консультации</u>. 
                            Наша команда экспертов всегда готова помочь вам в решении любых визовых задач «под ключ», 
                            от сбора документов до подачи визового заявления.
                        </p>
                    </div>

                    <CommentModalProvider>
                        <RippleButton onClick={openCommentModal}>
                            Задать вопрос
                        </RippleButton>
                    </CommentModalProvider>
                    {/* КНОПКУ СЮДА */}

                    <Faqs/>
                </div>

                {/* Inject FAQ Schema */}
                <script
                    type="application/ld+json"
                    dangerouslySetInnerHTML={{__html: JSON.stringify(faqSchema)}}
                />

                {/* Inject Article Schema */}
                <script
                    type="application/ld+json"
                    dangerouslySetInnerHTML={{__html: JSON.stringify(articleSchema)}}
                />

                <Contacts/>
            </div>
        </div>
    );
}